[
  {
    "title": "Google Pixel Watch 3 (41mm) Latest Model - Android Smartwatch, Heart Rate Tracking, Fitbit Advanced Running, Fitness Insights, 24-Hour Battery - Matte Black Aluminum Case - Obsidian Band - Wi-Fi",
    "rating": "4.4 out of 5 stars",
    "price": "$346.77",
    "features": "Heart Rate Monitor, Advanced Running, Fitness Insights, Readiness, Cardio Load, Google AI for Personalized Run Recommendations, Maps Offline, Wallet Payments, Transit and Access, Assistant Screen Calls Important Info, Fast Pair Pixel Devices, Music on the with Buds, Control Camera from Watch, See Nest Cam or Doorbell FeedSee more",
    "Battery Capacity": "3.4E+2 Milliamp Hours",
    "Connectivity": "Wi-Fi",
    "GPS": "Built-in GPS",
    "Screen Size": "41 Millimeters",
    "img_url": "https://m.media-amazon.com/images/I/614qNwigROL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "Brand": "Google",
    "Review": [
      {
        "review": "This is a fantastic watch.  I've been a long-time Fossil smartwatch user.  My Fossil Gen 6 watch started acting up, and I recently learned that Fossil has exited smartwatches.  Once I switched to the Pixel 3, I was thrilled and do not miss my Gen 6 at all.  I should have switched sooner.My 2nd Fossil replacement alternative was the OnePlus 2.  The Pixel looked better (to me) and has Wear OS 5 which is the most recent version.  It was hard to decide between the two using online descriptions and reviews, but I am happy with my choice.  The Pixel battery life is better than the Fossil, even with the always on display, and easily gets me though the day.  The charge may not last as long as the OnePlus 2, but I do not wear it overnight and instead put the watch on the charger, so the extra battery life is not an issue for me.  Others may see this differently.The Pixel 3 screen is MUCH brighter and sharper than the Fossil, the processor is faster, and the watch operation is intuitive and easy to learn.  Activating the watch, setting it up, and switching from the Fossil was quick and easy since most of the apps and info are tied to my Google account.Long-time irritants with the Fossil were how the end of the watch band kept flopping loose from its holder band, and how the crown button constantly activated when I sharply bent my wrist.  The Pixel fixes both of these issues.  The Pixel watch band is a bit tricky to attach at first (YouTube helps), but it works MUCH better than the Fossil and is more comfortable.  The Pixel has a nice feature where you can rotate the watch display 180 degrees (make it upside down) so you can wear the crown button on the left side of the watch.  No more accidental app activations, restarts, or 911 calls!My primary watch use is for business to monitor emails and texts, and to see/screen/take phone calls.  All these work beautifully, and are handled much better than with the Fossil.  Even the weather app is upgraded in the new OS, and there is a timer that can be added to the tiles.  I use my watch secondarily for the health features, and I was sad (at first) to learn Google Fit would not be on the Pixel.  I used Fit on the Fossil to track steps and distance walked.  The new FitBit basic version is a true upgrade and gives me all the info I had before, plus a lot more.  I did not opt for the free Premium FitBit trial.I bought and recommend a set of the plastic watch covers for scratch and impact protection, and a charging stand.  Both work great.",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "LOVE this watch!I bought this to track POTS and monitor for other heart symptoms. It's great for the HR tracker, ECG app and bonus sleep tracking/fitness tracking.The battery life is slightly less than some other similar items, but the quality and the smoothness of use is worth it.",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "I love the Google watch, it works well with the pixel phone, it wears nicely, also has Fitbit built in. It syncs great, definitely worth the money and much cheaper then other electronics watches.. it also charges quick when on charger sometimes faster then the cellphone.",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "I bought this to replace my fitbit that suddenly stopped working.  So far after 3 months this watch is working well. My phone is connected and the calls come through great. The display is great. I'm not sure it calculates my calories accurately when it tracks my spinning class, but that isn't a huge deal. I do recommend this item.",
        "rating": "4.0 out of 5 stars"
      },
      {
        "review": "What can I say? It's a Google product. I've had very little issues with this product and it seems to be a nice improvement over the previous models. Connectivity is good. Battery life is what it is. They advise you that it's not the longest lasting. It was easy to set up. And it's pretty easy to read even without my glasses on. Charging speed. It has improved as well",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "I'm extremely pleased with my purchase.  When my Fitbit Versa died I waited a while before buying another. Instead I tried a couple of cheaper watches but didn't like the app they used.  I missed the Fitbit app.  I didn't want to order another Versa so I decided to try the Google Pixel 3 even though the watch was round and not square as my previous watch.  However,  I find it much more comfortable to wear and it's more attractive than I thought it would be.  I love how it functions and the choices of watch faces.  I also like the fall notification feature since I'm in my 80's.  I normally don't write reviews unless I feel strongly about something.  I felt compelled to share my joy with this watch.  Glad I bought it.",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "Absolutely love my smart watch! This is my first brand name smart watch and I'm very satisfied with it. I like that it has Fitbit technology integrated with it as well. It is comfortable to wear and I love that I can change the band easily. The battery life is ok but I do wish it lasted longer though.",
        "rating": "5.0 out of 5 stars"
      }
    ]
  },
  {
    "title": "Google Pixel Watch 2 (Previous Model) with Best of Fitbit - Heart Rate Tracking, Stress Management, Safety Features - Android Smartwatch - Polished Silver Aluminum Case - Porcelain Active Band - LTE",
    "rating": "4.2 out of 5 stars",
    "price": "$199.99",
    "features": "Accelerometer, Activity Tracker, Always On Display, Body Temperature Monitor, Calorie Tracker",
    "Battery Capacity": "300",
    "Connectivity": "LTE",
    "GPS": "GPS Via Smartphone",
    "Screen Size": "41 Millimeters",
    "img_url": "https://m.media-amazon.com/images/I/61k+83jAaWL._AC_SY300_SX300_.jpg",
    "Brand": "Google",
    "Review": [
      {
        "review": "Obsessed with my pixel watch. I am a pixel phone user as well, so love that it connects with my Google fit and my Fitbit app. Lots of apps available on it, as well as phone answering and texting. Gps works great! I use it mostly to track my vitals and workouts. But my ring camera also connects to it and shows me when someone is at my door. Only negative is that the battery doesn't last long--maybe a day and a half. However, it charges quickly and I just set it on the charger while I do my makeup and get ready for my morning and it's almost fully charged by then. Lots of clock face customization too.",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "Item Purchased: Black Pre-Owned Google Pixel Watch 2The watch arrived in a resealed, open-box Google Pixel Watch 2 package. It included both watch band sizes and a USB-C charging cable, but no wall outlet—so if you don’t already have a USB-C wall charger, you may want to pick one up.The watch face was pristine and the device was very clean—overall, in excellent condition.Out of the box, the watch had a 34% charge and paired easily with my OnePlus phone. Even at that battery level, the battery saver mode held up well through a full 8-hour shift.Today, after a full charge, I used the watch mainly to track steps, check time, monitor health, and control media. I don’t get a lot of notifications or spend much time fiddling with it, and by the end of my 8-hour shift, the battery was still at 78%. So far, the battery health seems excellent.Overall, I’m really happy with the price and quality of this purchase—great value.",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "This watch is an upgrade from any Fitbit model in my opinion. I can easily access my contacts and create a message or call someone directly from my watch if I can't get to my phone. I find the step count more accurate than Fitbit while pushing a baby stroller.It charges using a magnetic charger via Type-C and charges within about an hour. The battery doesn't last as long as I'd like but it doesn't bother me unless I forget to charge my watch in the morning.It keeps track of my heart rate and monitors for any irregular signs.Very decent way for the value!",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "So I quickly learned after getting the watch a few days ago to go into the watch's settings, click battery, and turn on the battery saver. To have your watch come on, you gently tap the screen or press the crown button. This has greatly improved the battery life. But YOU shouldn't have to do that with a watch that costs this much.On the plus side, you can change just about every setting imaginable, and the Fitbit is a nice touch (despite most of the good features behind a subscription service). That's called Google greed. You'll get used to it. They're a monopoly for a reason. Using it to make and receive calls is awesome. Got a call the other day and was able to talk as I washed the dishes. No earbuds are required. The person who called me said the audio was great.I highly recommend this if you don't mind the craptacular battery life. I'm surprised they didn't fix it with a software update. Something is feasting on the power. Or they went with the lowest bidder for parts.Oh, if you have fat fingers or medium-sized ones, forget about the keyboard. LOL. You'll need a stylus (yes they work). The speech-to-text is very good but you have to remember to say \"period\" or \"comma\" when composing messages. If you don't, it'll be one long sentence without proper punctuation. You can even say \"heart emoji\" and it'll insert that. You can also go back and edit the message with your fingers and use the keyboard to correct mistakes. I'll update my review if needed and the longer I use it. Oh, the ECG works and is very cool. Even the sleep monitor caught my apnea.",
        "rating": "4.0 out of 5 stars"
      },
      {
        "review": "I just received my watch, I am thrilled to use it! Sleep tracking works, charges fast, easy to use. I went with black on black because I'm not a fan of silver, and I love the look/color. The watch face I selected is bright enough, but not overwhelming. Definitely seems like a great value for the money, but time will tell.Update: 11/22/24- so I've had this watch for one month now and I absolutely love it. The only thing I would say that is negative about it, is it needs charged a lot... But other than that I am so happy with my purchase.",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "I recently purchased the Google Pixel Watch 2 as 'used - very good condition' and was absolutely thrilled with what I received. The watch arrived looking brand new, still in its original, albeit open, box with no signs of use whatsoever. The charging cable and extension band were also neatly tucked inside.From a design perspective, this watch is truly a stunner. The aesthetics are very pleasing, and it feels like a premium device on the wrist. Google has clearly used top-tier components, as evidenced by its smooth performance and responsive interface. For me, the size is perfect – it's substantial enough to make a statement but not so bulky that it feels uncomfortable for all-day wear.Considering the \"used - very good condition\" price point and the practically brand-new watch I received, this was an outstanding value. I'm incredibly happy with this purchase and would highly recommend it to anyone looking for a high-quality smartwatch.",
        "rating": "5.0 out of 5 stars"
      }
    ]
  },
  {
    "title": "Google Pixel Watch 3 (45mm) Latest Model - Android Smartwatch, Heart Rate Tracking, Fitbit Advanced Running, Fitness Insights, 24-Hour Battery - Matte Black Aluminum Case - Obsidian Band - Wi-Fi",
    "rating": "4.4 out of 5 stars",
    "price": "$399.99",
    "features": "Sleep Monitor, Email, Accelerometer, Body Temperature Monitor, ECG, Activity Tracker, Always On Display, Calorie Tracker, Stress Tracking, Contactless Payments, Fall Detection, Heart Rate MonitorSee more",
    "Battery Capacity": "N/A",
    "Connectivity": "Wi-Fi",
    "GPS": "GPS Via Smartphone",
    "Screen Size": "45 Millimeters",
    "img_url": "https://m.media-amazon.com/images/I/61-JMO7a6+L._AC_SY300_SX300_.jpg",
    "Brand": "Google",
    "Review": [
      {
        "review": "This is a fantastic watch.  I've been a long-time Fossil smartwatch user.  My Fossil Gen 6 watch started acting up, and I recently learned that Fossil has exited smartwatches.  Once I switched to the Pixel 3, I was thrilled and do not miss my Gen 6 at all.  I should have switched sooner.My 2nd Fossil replacement alternative was the OnePlus 2.  The Pixel looked better (to me) and has Wear OS 5 which is the most recent version.  It was hard to decide between the two using online descriptions and reviews, but I am happy with my choice.  The Pixel battery life is better than the Fossil, even with the always on display, and easily gets me though the day.  The charge may not last as long as the OnePlus 2, but I do not wear it overnight and instead put the watch on the charger, so the extra battery life is not an issue for me.  Others may see this differently.The Pixel 3 screen is MUCH brighter and sharper than the Fossil, the processor is faster, and the watch operation is intuitive and easy to learn.  Activating the watch, setting it up, and switching from the Fossil was quick and easy since most of the apps and info are tied to my Google account.Long-time irritants with the Fossil were how the end of the watch band kept flopping loose from its holder band, and how the crown button constantly activated when I sharply bent my wrist.  The Pixel fixes both of these issues.  The Pixel watch band is a bit tricky to attach at first (YouTube helps), but it works MUCH better than the Fossil and is more comfortable.  The Pixel has a nice feature where you can rotate the watch display 180 degrees (make it upside down) so you can wear the crown button on the left side of the watch.  No more accidental app activations, restarts, or 911 calls!My primary watch use is for business to monitor emails and texts, and to see/screen/take phone calls.  All these work beautifully, and are handled much better than with the Fossil.  Even the weather app is upgraded in the new OS, and there is a timer that can be added to the tiles.  I use my watch secondarily for the health features, and I was sad (at first) to learn Google Fit would not be on the Pixel.  I used Fit on the Fossil to track steps and distance walked.  The new FitBit basic version is a true upgrade and gives me all the info I had before, plus a lot more.  I did not opt for the free Premium FitBit trial.I bought and recommend a set of the plastic watch covers for scratch and impact protection, and a charging stand.  Both work great.",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "LOVE this watch!I bought this to track POTS and monitor for other heart symptoms. It's great for the HR tracker, ECG app and bonus sleep tracking/fitness tracking.The battery life is slightly less than some other similar items, but the quality and the smoothness of use is worth it.",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "I love the Google watch, it works well with the pixel phone, it wears nicely, also has Fitbit built in. It syncs great, definitely worth the money and much cheaper then other electronics watches.. it also charges quick when on charger sometimes faster then the cellphone.",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "I bought this to replace my fitbit that suddenly stopped working.  So far after 3 months this watch is working well. My phone is connected and the calls come through great. The display is great. I'm not sure it calculates my calories accurately when it tracks my spinning class, but that isn't a huge deal. I do recommend this item.",
        "rating": "4.0 out of 5 stars"
      },
      {
        "review": "What can I say? It's a Google product. I've had very little issues with this product and it seems to be a nice improvement over the previous models. Connectivity is good. Battery life is what it is. They advise you that it's not the longest lasting. It was easy to set up. And it's pretty easy to read even without my glasses on. Charging speed. It has improved as well",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "I'm extremely pleased with my purchase.  When my Fitbit Versa died I waited a while before buying another. Instead I tried a couple of cheaper watches but didn't like the app they used.  I missed the Fitbit app.  I didn't want to order another Versa so I decided to try the Google Pixel 3 even though the watch was round and not square as my previous watch.  However,  I find it much more comfortable to wear and it's more attractive than I thought it would be.  I love how it functions and the choices of watch faces.  I also like the fall notification feature since I'm in my 80's.  I normally don't write reviews unless I feel strongly about something.  I felt compelled to share my joy with this watch.  Glad I bought it.",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "Absolutely love my smart watch! This is my first brand name smart watch and I'm very satisfied with it. I like that it has Fitbit technology integrated with it as well. It is comfortable to wear and I love that I can change the band easily. The battery life is ok but I do wish it lasted longer though.",
        "rating": "5.0 out of 5 stars"
      }
    ]
  },
  {
    "title": "Google | Pixel Watch | Android Smartwatch with Fitbit Activity Tracking | Fitness and Sleep Tracker with Heart Rate Tracker | 41mm (Renewed)",
    "rating": "3.7 out of 5 stars",
    "price": "$89.99",
    "features": "Contactless Payments",
    "Battery Capacity": "N/A",
    "Connectivity": "Bluetooth",
    "GPS": "Built-in GPS",
    "Screen Size": "41 Millimeters",
    "img_url": "https://m.media-amazon.com/images/I/516N+mveMsL._AC_SY300_SX300_.jpg",
    "Brand": "Google",
    "Review": [
      {
        "review": "Wanted a watch to match my wife's new phone but didn't really want to invest $300+ in a new model before seeing if she would wear it.  This option was appealing because the pixel 1 watch, undoubtedly without the same functionality as the more recent 3, looks almost identical to my old eyes as the current model.  It didn't come in the original box, but 2 different colored (gray and black) straps were included with the charger cable. The straps took a few seconds to figure out how to attach to the watch face, but it was pretty intuitive. Just kind of slide/hook them in.  It had enough battery to immediately power up, and she's been thrilled with it ever since, tracking her steps and other useful features to monitor as she's walking around a hospital all day. Looks and fits great, and excellent functionality.  Only complaint would be the proprietary charger has a USB C you have to plug in somewhere and the only charger I had you could plug in a USB C cable to charge was my own phone charger so we've been battling over that until we remember to get one out. One included would've been nice, or at least being more informative that one would be needed.",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "I bought this watch twice. The first watch was in excellent cosmetic condition. BUT it wouldn't charge. Returned it for a refund. A few weeks later, I bought it again (renewed). When pairing it with my phone, it stopped. The temperature icon showed up and watch was pretty hot. It is being sent back for a refund. Cosmetically perfect.",
        "rating": "1.0 out of 5 stars"
      },
      {
        "review": "UPDATE: The 3rd party charger it came with failed, it's working great now with an official Google charger.I really like this watch, it does all I need in a smart watch and I'm able to turn off the features I don't use. It arrived in good condition, but with a third-party charger. It charged fine for a few weeks but gradually the charger had difficulty starting and maintaining the charging process. Now the battery is dead and only gets the lightning bolt icon when on the charger but doesn't charge. I've ordered an official charger from Google for this watch and hope that will bring it back to life.",
        "rating": "4.0 out of 5 stars"
      },
      {
        "review": "Amazing I love the Google Pixel watch. It was Soo worth it every penny. Love how u can text and call on it. Honestly the battery life lasts like 6 or 7 hours for me. It charges pretty quick I'm using a 30 watt fast charging brick. Seems durable to me , easy to use definitely, looks amazing 💯. Everyone go grab this u'll love it trust me. Texting is very accurate n easy.",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "Ngl. Im glad i got it, as a security guard. All the small features it has, really makes the difference in my day to day tasks. I haven't wore a watch since 2016. Feels good to have one again.",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "The pride is hard to beat, but there was a fairly large scratch on the corner of the screen. Still works as expected and isn't in the viewing area, but still disappointing that is has a large cosmetic defect. Charged and connected up flawlessly at least.",
        "rating": "3.0 out of 5 stars"
      },
      {
        "review": "1.  Looks great, no scratches or blemishes on front of watch2.  Actually functions fully, unlike other refurbished Pixel watches I triedI am extremely pleased with this purchase and wouldn't hesitate to buy again",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "Update. Will not charge or boot. Common problem per Reddit. Retuned. Avoid.Arrived in good cosmetic shape. Battery life isn't stellar, but functionally far superior to my amazefit cause Google app integration. If ur on the fence, go for it.",
        "rating": "1.0 out of 5 stars"
      }
    ]
  },
  {
    "title": "Google | Pixel Watch | Android Smartwatch with Fitbit Activity Tracking | Fitness and Sleep Tracker with Heart Rate Tracker | 41mm (Renewed)",
    "rating": "3.7 out of 5 stars",
    "price": "$61.82",
    "features": "Contactless Payments",
    "Battery Capacity": "N/A",
    "Connectivity": "Bluetooth",
    "GPS": "Built-in GPS",
    "Screen Size": "41 Millimeters",
    "img_url": "https://m.media-amazon.com/images/I/516N+mveMsL._AC_SY300_SX300_.jpg",
    "Brand": "Google",
    "Review": [
      {
        "review": "Wanted a watch to match my wife's new phone but didn't really want to invest $300+ in a new model before seeing if she would wear it.  This option was appealing because the pixel 1 watch, undoubtedly without the same functionality as the more recent 3, looks almost identical to my old eyes as the current model.  It didn't come in the original box, but 2 different colored (gray and black) straps were included with the charger cable. The straps took a few seconds to figure out how to attach to the watch face, but it was pretty intuitive. Just kind of slide/hook them in.  It had enough battery to immediately power up, and she's been thrilled with it ever since, tracking her steps and other useful features to monitor as she's walking around a hospital all day. Looks and fits great, and excellent functionality.  Only complaint would be the proprietary charger has a USB C you have to plug in somewhere and the only charger I had you could plug in a USB C cable to charge was my own phone charger so we've been battling over that until we remember to get one out. One included would've been nice, or at least being more informative that one would be needed.",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "I bought this watch twice. The first watch was in excellent cosmetic condition. BUT it wouldn't charge. Returned it for a refund. A few weeks later, I bought it again (renewed). When pairing it with my phone, it stopped. The temperature icon showed up and watch was pretty hot. It is being sent back for a refund. Cosmetically perfect.",
        "rating": "1.0 out of 5 stars"
      },
      {
        "review": "UPDATE: The 3rd party charger it came with failed, it's working great now with an official Google charger.I really like this watch, it does all I need in a smart watch and I'm able to turn off the features I don't use. It arrived in good condition, but with a third-party charger. It charged fine for a few weeks but gradually the charger had difficulty starting and maintaining the charging process. Now the battery is dead and only gets the lightning bolt icon when on the charger but doesn't charge. I've ordered an official charger from Google for this watch and hope that will bring it back to life.",
        "rating": "4.0 out of 5 stars"
      },
      {
        "review": "Amazing I love the Google Pixel watch. It was Soo worth it every penny. Love how u can text and call on it. Honestly the battery life lasts like 6 or 7 hours for me. It charges pretty quick I'm using a 30 watt fast charging brick. Seems durable to me , easy to use definitely, looks amazing 💯. Everyone go grab this u'll love it trust me. Texting is very accurate n easy.",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "Ngl. Im glad i got it, as a security guard. All the small features it has, really makes the difference in my day to day tasks. I haven't wore a watch since 2016. Feels good to have one again.",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "The pride is hard to beat, but there was a fairly large scratch on the corner of the screen. Still works as expected and isn't in the viewing area, but still disappointing that is has a large cosmetic defect. Charged and connected up flawlessly at least.",
        "rating": "3.0 out of 5 stars"
      },
      {
        "review": "1.  Looks great, no scratches or blemishes on front of watch2.  Actually functions fully, unlike other refurbished Pixel watches I triedI am extremely pleased with this purchase and wouldn't hesitate to buy again",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "Update. Will not charge or boot. Common problem per Reddit. Retuned. Avoid.Arrived in good cosmetic shape. Battery life isn't stellar, but functionally far superior to my amazefit cause Google app integration. If ur on the fence, go for it.",
        "rating": "1.0 out of 5 stars"
      }
    ]
  },
  {
    "title": "Google Pixel Watch, 41mm Polished Silver Case w/Charcoal Active Band, Android Smartwatch, Fitbit Activity, Fitness, Sleep, Heart Rate Tracking, LTE Support",
    "rating": "4.3 out of 5 stars",
    "price": "$75.99",
    "features": "GPS",
    "Battery Capacity": "294 Milliamp Hours",
    "Connectivity": "Bluetooth",
    "GPS": "Gps Route Tracking",
    "Screen Size": "1.2 Inches",
    "img_url": "https://m.media-amazon.com/images/I/71qRyJxNa+L._AC_SY300_SX300_.jpg",
    "Brand": "Google",
    "Review": [
      {
        "review": "Muy lindo",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "Llegado muchísimos dias antes de lo planeado, pero le doy 4 estrellas porque  el reloj tenía unos sellos extraños que me puso a dudar si realmente el reloj es nuevo, note como unas huellas, no veo  señales de maltrato. Hasta allí todo bien, pero note que la batería se agota muy rápido  mientras lo configurada perdió mucho porcentaje.Edit: si quieren un reloj  para monitorear 24/7 este reloj no lo es, la autonomía es muy mal es el único defecto  del reloj.",
        "rating": "4.0 out of 5 stars"
      },
      {
        "review": "The watch was exactly what I wanted, close to it anyway.  Easy to set up using the app.  Instructions were easy so it was quick. The inter-changeable faces worked out well.  But the buttery life truly sucks. I might get 2 days before I have to charge it. I haven’t had it on for a week. Love the watch, hate the battery life. If I had paid attention to another review and knowing what I know now, I wouldn’t have bought it.",
        "rating": "2.0 out of 5 stars"
      }
    ]
  },
  {
    "title": "Google Pixel Watch, 41mm Polished Silver Case w/Chalk Active Band, Android Smartwatch with Fitbit Activity, Fitness, Sleep, Heart Rate Tracking, LTE Support",
    "rating": "4.1 out of 5 stars",
    "price": "$79.99",
    "features": "Sleep Tracking, Activity Tracker, Heart Rate Monitor, Fitness Tracking",
    "Battery Capacity": "294 Milliamp Hours",
    "Connectivity": "Bluetooth, Gps, Lte",
    "GPS": "Built-in GPS",
    "Screen Size": "1.2 Inches",
    "img_url": "https://m.media-amazon.com/images/I/7112VgsodjL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "Brand": "Google",
    "Review": [
      {
        "review": "Exactly as described!",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "I was hesitant to try this, I have had a Fitbit for years. But they kept breaking. Wouldn't charge, hard to connect etc.I have this for 4 days and so far it has been easier to use, no problems with connecting, holds the charge. I think it will require a daily charge but it charges fast so it's not problem for me.",
        "rating": "4.0 out of 5 stars"
      },
      {
        "review": "I bought this for a mother's day gift, when searching for the watch I made sure to write in NEW. No where in the description or details of the item does it say it's used. The watch did not have a protective film on the screen, box was open, you can see where sticker looks like it's been open multiple times and the box had lint in it. I would not recommend this item unless you are looking for used items.",
        "rating": "1.0 out of 5 stars"
      }
    ]
  },
  {
    "title": "Google Pixel Watch 41mm Smartwatch with WiFi, GPS, BT and Heart Rate Monitor in Bulk Packaging (Polished Silver) (Renewed)",
    "rating": "1.0 out of 5 stars",
    "price": "$66.40",
    "features": "GPS",
    "Battery Capacity": "N/A",
    "Connectivity": "Wi-Fi",
    "GPS": "Built-in GPS",
    "Screen Size": "41 Millimeters",
    "img_url": "https://m.media-amazon.com/images/I/613nYTUEQOL.__AC_SX300_SY300_QL70_ML2_.jpg",
    "Brand": "Google",
    "Review": [
      {
        "review": "The charger and watch itself gets very hot!",
        "rating": "1.0 out of 5 stars"
      }
    ]
  },
  {
    "title": "Google Pixel Watch 41mm Smartwatch with WiFi, GPS, BT and Heart Rate Monitor in Bulk Packaging (Polished Silver) (Renewed)",
    "rating": "1.0 out of 5 stars",
    "price": "$66.40",
    "features": "GPS",
    "Battery Capacity": "N/A",
    "Connectivity": "Wi-Fi",
    "GPS": "Built-in GPS",
    "Screen Size": "41 Millimeters",
    "img_url": "https://m.media-amazon.com/images/I/613nYTUEQOL.__AC_SX300_SY300_QL70_ML2_.jpg",
    "Brand": "Google",
    "Review": [
      {
        "review": "The charger and watch itself gets very hot!",
        "rating": "1.0 out of 5 stars"
      }
    ]
  }
]