[
  {
    "title": "Xiaomi Redmi Watch 5 Active Midnight Black",
    "rating": "4.5 out of 5 stars",
    "price": "$38.00",
    "features": "Activity Tracker",
    "Battery Capacity": "100 Amp Hours",
    "Connectivity": "Bluetooth",
    "GPS": "No GPS",
    "Screen Size": "2 Inches",
    "img_url": "https://m.media-amazon.com/images/I/71bUqVw+fEL._AC_SY300_SX300_.jpg",
    "Brand": "Xiaomi",
    "Review": [
      {
        "review": "I would definitely recommend this one for anyone looking for a low budget Great quality and features. Tracks exercise etc",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "This watch works great for the money that you pay for it. You cannot really ask much more. I cared perfectly with my xiaomi phoneThis watch works great for the money that you paid for it. You cannot really ask much more. It paired perfectly with my xiaomi phone",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "it works great and battery last more than a week.",
        "rating": "4.0 out of 5 stars"
      },
      {
        "review": "It does most tricks my apple watch do.  But 15% of cost.",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "Had it for 3 days so far. Excellent battery life even with all the bells and whistles kept on. Measures/tracks sleep beautifully. Answers relays calls with ease. Doesn't measure body composition or EKG like my old samsung,  but it's also a fraction of the price. I'm never buying an expensive smartwatch again.",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "I'm loving my Xiaomi Redmi Watch 5 Active in Midnight Black! It's stylish and comfortable to wear, making it perfect for everyday use. The watch fits well on my wrist and hasn't caused any discomfort, even during long wear. Great product!",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "This watch has great selection of watch faces, and records sleep, heart rate and exercises well. The app is user friendly and sync is almost instantaneous. Charging is fast and lasted me a week at minimum. The only issue I've noticed was when I tried logging walking outdoors it was trying to connect to GPS signal but couldn't even though I was in a clear area. Other than that a solid, good looking smartwatch and highly recommend.",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "I love the features on here. I tried about 7 watches before keeping this one. Good battery life. Functionality for certain features like the timer was important to me & this had it! It's beyond worth the money! Being able to answer calls, check the weather, & the calendar are bonuses I didn't even expect, but find very useful.",
        "rating": "5.0 out of 5 stars"
      }
    ]
  },
  {
    "title": "Xiaomi Smart Band 9 Global Version (2024) 1.62\" Amoled Display | 233 mAh Battery | up to 21 Days of Battery Life | Over 150 Workout Modes | BT 5.4 | 50M Water Resistant - Midnight Black",
    "rating": "4.4 out of 5 stars",
    "price": "$58.99",
    "features": "Heart Rate Monitor",
    "Battery Capacity": "233 Milliamp Hours",
    "Connectivity": "Bluetooth",
    "GPS": "GPS Via Smartphone",
    "Screen Size": "1.62 Inches",
    "img_url": "https://m.media-amazon.com/images/I/51JxfghPRwL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "Brand": "Xiaomi",
    "Review": [
      {
        "review": "I have had this product for a week now and I am love it. I was hesitant at first to buy a smart watch because of the accuracy, expensive prices, and another screen to distract me. I turned off the call and text notifications right away so I don't have the distraction. The price is amazing for the capabilities. It actually has more capabilities that are useful and make my everyday life more convenient. I really just wanted it to track my sleep and it does a great job!Specs that I like:- battery lasts for days. I haven't even drained the battery yet because when it gets to 80% after two days, it only takes 20 minutes to charge back!- display interfaces that you can change and personalize- real-time data of heart rate, sleep data - which is accurate to the minute I wake up.- can take pictures and video by tapping my smart watch when phone is on tripod- timer- quiet, vibrating morning alarm clock- can pause or forward music playing on my phone from watchDownsides:- the app did logout of my profile unknowingly so that erased my data overtime (maybe I did something wrong here)",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "I had a mi band 6 before this. The touch screen stopped responding after 3 years or so. To be fair, I was wearing it while working with spraying water and sludge, and I am hard on my watch. I am constantly banging it into things. I tried a 30 dollar knockoff smartwatch first as a replacement,  but it was too much fuss and irritation. I don't need to dial a phone number on my watch. Really all I was looking for was steps, heart rate,  time, and notifications.  The mi band 9 handles them all well. The screen is crisp and bright, easy to see in the sun or inside. Swiping on the screen works well.  You can select your own shortcuts to swipe left to. Notifications come over very quickly.  I have not noticed any extra battery drain. The vibration is perhaps a little lower than I would prefer, but it is enough to wake me up in the morning,  which I find much less irritating than the alarm on my phone. I would definitely recommend it. The only thing to see is if the new screen holds up as well as the old one, but there are screen protectors if needed.",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "I'm a fan of the Xiaomi Smart Band. I used the Mi Band 5 and 7, and this time I bought the Mi Band 9. The app isn’t very intuitive, and the user guide for the Mi Band isn’t exactly easy to follow either. However, once I get used to the functions I want to use, the simplicity and lightweight comfort of the Mi Band make it the only one I end up using. The Mi Band 7 and 9 don’t seem to have changed much, but the 7 has been a great help to me over the past two years. The Mi Band 7 didn’t just stop working; it 'died in the line of duty,' having served me faithfully for two years before it passed away.I’ll tell you the story of how I first got introduced to the Mi Band. Back then, it was the Mi Band 5, but since the difference in features is not significant compared to the current Mi Band 9, it remains a useful reference before making a purchase.Company C’s warehouse somewhere in Asia—I worked 8 hours a day pulling a cart non-stop—literally no (official) break time. My job was to find the ordered items, load them up, and deliver them to the ladies who did the packing. The only time I could sit without worrying was during lunch. But being exhausted, full from eating, and sitting down? That’s a perfect recipe for dozing off every time. So, I decided to get myself a reliable alarm clock to keep me awake.I considered a $2 stopwatch from a dollar store (Daiso), but it got eliminated in the final round because changing the battery was a hassle. Instead, I ended up with a much pricier but fancier Mi Band 5. On the first day, I was just happy it told time accurately, but then I realized—it also counted my heartbeats while I was dozing off. Wow, new tech. But, seriously, why? At this point, it might as well have had a feature that automatically alerts a funeral home if my heart stops while I’m sleeping. Anyway, back to work I went.Here are my thoughts after using it for a few days—just personal impressions and some random questions. If you are already reading reviews, you probably know all the functions. So instead of a spec rundown, here’s how I actually use them:Sleep MonitoringIt sends something—electrical signals? Radio waves?—to my wrist at intervals I set (once every minute or every 10 minutes). The fact that only my wrist feels sore in the morning tells me I have clearly been in an inappropriate relationship with this gadget overnight. I don’t even use a microwave, and this doesn’t feel great. But it’s fascinating, so I give it two nights. Then it starts nagging me like my mom did 30 years ago: \"You went to bed too late. Sleep earlier. You didn’t get enough deep sleep.\" It even logs the exact time I get up to use the bathroom. Now, that’s impressive.ExerciseThe only workout I do is running. I don’t have any heart conditions, so I never care about heart rate. But I do like that it tracks my distance. At my age, I need to brag about how far I can still run.Menstrual Cycle Tracking & AlertsI’m a guy.Battery Life & ChargingThe battery lasts forever. Charging is easy. No complaints.Stress MonitoringI already know when I’m stressed. Do I really need a watch to tell me? Also, it doesn’t seem to differentiate between stress, tension, and excitement—like the kind of excitement you get from certain situations, for example.Final ThoughtsIf you are old enough to need reading glasses to see this text, listen up: Mi Band 9’s font is tiny. If you just want the time displayed in big numbers, that’s fine, but cramming multiple bits of info on one screen? Forget it.It is packed with features, but let’s be real—who is actually going to check their sleep data every day for a year? Your sleep quality won’t improve just because you look at the numbers. And honestly, how many buyers really have serious arrhythmia concerns? Unless you do, heart rate tracking isn’t that useful. Also, if your phone is within reach, why would you squint at this tiny screen for texts or fumble with your fat fingers trying to change songs? That’s just comedy.It is basically a cute gadget watch. But!If you’ve read this far, you’re already too invested. Let’s be real—you’ll probably hit that \"Buy Now\" button tonight and go to bed pretending it never happened. Just get this over with, and stop thinking about your next purchase for now. Free yourself from the agony—buy it now, and move on.Objectively, just the watch and step tracker alone make it worth it. It also has a handy feature to help you find your phone. A solid, sleek, and not-too-cheap-looking digital watch for under $45? That’s not easy to find. And if playing around with its features makes you enjoy working out for a month or two, that alone justifies the price. For serious fitness folks, you might even discover more useful functions than I did.And when you get bored? Swap out the band (about $7) or trade it with your nephew for an Attack on Titan figurine, a popular anime character. It has a design that kids totally fall for.Good luck.",
        "rating": "4.0 out of 5 stars"
      }
    ]
  },
  {
    "title": "Xiaomi Redmi Watch 5 Active Smartwatch, 2.0\" LCD Display, 18 Days of Battery Life, 140+ Sports Modes, 5ATM Waterproof, Bluetooth Calling, Fitness-Tracker- Matte Silver",
    "rating": "4.5 out of 5 stars",
    "price": "$38.00",
    "features": "Activity Tracker",
    "Battery Capacity": "100 Amp Hours",
    "Connectivity": "Bluetooth",
    "GPS": "No GPS",
    "Screen Size": "2 Inches",
    "img_url": "https://m.media-amazon.com/images/I/61Hx8OI1SoL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "Brand": "Xiaomi",
    "Review": [
      {
        "review": "Excellent condition, recommend.",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "If you are looking for a watch for the low that does everything you need, buy this smartwatch!  It keeps up with all the metrics for a healthy lifestyle except logging your food.✅ Battery life great✅ value for your money✅ easy to use",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "Muy bonito me encantó es demasiado hermoso lo recomiendo y sobretodo buen material bien empacado",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "\"I'm really enjoying my smartwatch! The battery life is impressive, and the interface is super easy to use. Most of the features are great, although I wish there were more belt options available. Overall, it's a solid choice!\"",
        "rating": "4.0 out of 5 stars"
      },
      {
        "review": "Excelente equipo",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "Super compra con este reloj calidad precio ufff 1A",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "Fascinado con la compra, se lo regalé a mi esposa y el ajuste fue perfecto",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "Fascinating. I walk a lot more now just to check my fitness and steps etc.",
        "rating": "5.0 out of 5 stars"
      }
    ]
  },
  {
    "title": "Xiaomi Redmi Watch 5 Lite Global 1.96\" Amoled Up to 18 Days Battery GNSS Dual Mic 150+ Workout Modes 5ATM Water Resistance Heart Rate Sensor (Black)",
    "rating": "4.4 out of 5 stars",
    "price": "$48.50",
    "features": "Phone Call",
    "Battery Capacity": "470 Milliamp Hours",
    "Connectivity": "Bluetooth",
    "GPS": "Built-in GPS",
    "Screen Size": "1.96 Inches",
    "img_url": "https://m.media-amazon.com/images/I/71qq-p26D4L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "Brand": "Xiaomi",
    "Review": [
      {
        "review": "Good watch. I have had it just over two weeks now and I am very happy with it. The size is right for me, the display is large and easy to read and there are plenty of watch faces to choose from. I'm not into sports or workouts so it's had light use so far. At just over two weeks it still has over 50 percent charge. I like the sleep tracker and heart rate monitor and the text and phone alerts have been useful. I've used the timer function too and it beats having to pull out my phone and go through the process of setting a timer on it. I swapped out the band it came with after wearing it a few days. I prefer the old-fashioned style that has a buckle and keeper loops to hold the free end. For under $50 I think it would be hard to find one that works this well. Set up was fast and easy, too.",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "The watch works very well.  Battery life is great. The band however was reacting with my skin. Would advise to purchase a different band if skin is sensitive to this type of material.Works well when exercising and I love the reminders to stand when sitting for too long.",
        "rating": "4.0 out of 5 stars"
      },
      {
        "review": "Great watch. many functions",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "GREAT PRODUCT",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "producto muy bueno muy recomendado",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "Buen reloj",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "Ví varias reseñas antes de comprar este artículo y ninguna mencionaba el error que tuve con el reloj, al intentar configurar el reloj mediante la aplicación presentaba muchos errores, cuando finalmente pude conectarlo y configurarlo a mi gusto se reinció y toda su configuración volvió a como venía de fabrica. Lo configure nuevamente y lo usé sin problemas el resto del día. Al día siguiente revisé el monitoreo del sueño y salía que había dormido  tan solo 1 hora y toda su configuración se volvió a reiniciar.He tenido este problema que el reloj se reseta de fabrica sin ninguna razón aparente durante estos días que llevo usandolo, en lo personal he tenido varios wearebles de la marca y es la primera vez que un problema como este me sucede, investigando en foros descubrí que no era un problema aislado, mas bien a muchas personas les ocrria lo mismo, por lo que parece que es un problema de software y que la empresa no piensa solucionar pronto.Ahora mismo no puedo devolver el reloj ya que me encuentro en otro país enronces practicamente voy a perder el dinero. Mi recomención sería que eviten comprar dispositrivos de xiaomi al menos hasta que decidan arreglar estos errores en sus wearables.",
        "rating": "1.0 out of 5 stars"
      }
    ]
  },
  {
    "title": "Xiaomi Smart Band 9 Global Version (2024) 1.62\" Amoled Display | 233 mAh Battery | up to 21 Days of Battery Life | Over 150 Workout Modes | BT 5.4 | 50M Water Resistant - Mystic Rose",
    "rating": "4.5 out of 5 stars",
    "price": "$48.99",
    "features": "Heart Rate Monitor, Activity Tracker",
    "Battery Capacity": "233 Milliamp Hours",
    "Connectivity": "Bluetooth",
    "GPS": "No GPS",
    "Screen Size": "1.62 Inches",
    "img_url": "https://m.media-amazon.com/images/I/61l8DivZnXL.__AC_SX300_SY300_QL70_ML2_.jpg",
    "Brand": "Xiaomi",
    "Review": [
      {
        "review": "As a former Fitbit and Samsung fitness watch wearer I am extremely pleased with this item. I get the same, if not more options,  than I did with my previous higher end watches for a fraction of the cost. The battery lasts for days and days. I can track sleep, heart rate, steps, get my text messages and app messages.  I'm still diving into everything it can do. The only drawbacks are it doesn't sync directly with any of my fitness apps but Samsung offers a backdoor way of syncing it's information via the Samsung health app on my phone. Another drawback is that it drains your phone battery much quicker due to the constant connection between the watch and phone. I just turn off the Bluetooth connection when I don't need the notifications from my phone pinged to my watch. However there's still a good bit of drain from the app even after this has been done.  Not a deal breaker but be aware and have charging options available when needed.",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "I bought this because the old fitbit that I used at work broke. I have an Apple watch but then I don’t want to use it because I’m afraid it will end up being broken at work too (I already broke 2 Fitbit watches due to the nature of my work). And since it’s almost the same size as my fitbit, my husband recommended this brand. I usually don’t wear watch when I’m at home but now even after work, I’m still wearing it. I like how it tracks my sleep hours, steps and calories burned. My apple watch has too much apps that I don’t need, gets low batt easily, and it looks big for my small wrist (I got it as a gift). Xiaomi has the basic apps that I need making it battery efficient. I can go on days without charging it. I only charge it when I drive (30mins most of the time) and that’s enough to have it 100% charged. I love its size compared to my apple watch too. Not too wide. Just right for my wrist size. I sometimes forget that I’m wearing it. The straps are easy to put on with a snap. There’s a decent amount of display themes to choose from. The 2 downsides for me: 1. The brightness doesn’t adjust, so when it’s bedtime and I move my arm…tadaaa bright display coming up. 2. It doesn’t sync every time like my Apple watch. Sometimes I have to manually sync it using the app so my stats will record or the weather gets updated on the watch. But nonetheless, it’s still a 5 stars for me because I love the functionality and ease of use of this watch. Plus, it’s not pricy 😊",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "This is my first smartwatch, so I don't have any comparison. But I really love this watch, the design is simple and gives me information about my steps, calories and heart rate. I love that you can choose between a lot of workout options, and it even has boxing as an option. I think for a beginner watch, this is perfect. The battery lasts me about a week and the size is not too big and not too small for my liking.",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "Generally it covers almost all functions of a smart band, but not good for a sports tracking device such as Fitbit Charge 4 or Huawei’s Band 10 E93 which I bought for myself. It claims it has 21 day battery life, over two weeks of the Huawei band 10. What it adds thinness of a device supposedly thin and light. The steps it counts (4000’s) were much less than I actually runs (6000’s). The band is not flexible or soft enough. It vibrates often to give warnings of loosing GPS connections when I do swimming because my phone was left on the bench besides the pool, which was annoying during swimming. I know you can turn it silent. In all, it’s good for a smart band, especially at a fairly good price. The attached photos showed Xiaomi (pink) and Huawei band 10 (blue).",
        "rating": "4.0 out of 5 stars"
      },
      {
        "review": "Great cheap watch to do simple things",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "Excelente el producto",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "Muy bien relación calidad precio",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "First of all I would like to say that delivery was very fast, it was also well packed. I am loving my xiaomi smart band . Have been using it for about 2 weeks now and it meets all my requirements. It’s light enough to keep it on my wrist during sleeping. It tracks your sleep patterns pretty well, counts your steps and so much more. It was a breeze to connect it to my phone and what I like about it the most is that a battery lasts a long time, it takes about 50 min to charge from 0 to 100% and the battery lasts few weeks.",
        "rating": "5.0 out of 5 stars"
      }
    ]
  },
  {
    "title": "Xiaomi Smart Band 9 Pro Smartband Global Version 1.74\" Display Blood Oxygen GPS Health Monitoring Fitness Tracker 150+ Sports Mode - Obsidian Black",
    "rating": "4.4 out of 5 stars",
    "price": "$78.25",
    "features": "GPS",
    "Battery Capacity": "N/A",
    "Connectivity": "Bluetooth",
    "GPS": "GPS Via Smartphone",
    "Screen Size": "1.74 Inches",
    "img_url": "https://m.media-amazon.com/images/I/71L64It8hIL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "Brand": "Xiaomi",
    "Review": [
      {
        "review": "I bought this to replace my Galaxy Watch 5 (and a pink one to replace my girlfriend's Galaxy Watch 4), because we had to charge our watches every 14 hours or so and they were getting more sluggish by the month. I always like to break electronics down on a simple pros & cons list, so let's have at it (in alphabetical order)._:PROS:_- Battery life is superb. I could definitely see getting 3 weeks out of a charge if I turned off all the extra features. As it stands, I typically get at least 10 days with sleep tracking and AOD (always-on-display) turned on, (both of which the watch warns you will reduce battery life). Charging from ~10% to 100 only takes about 2 hours as well on a normal 1A charger.--- Battery optimization options also are excellent, such as \"smart AOD\" (turns the screen off when the watch detects you're sleeping or when the watch isn't on your wrist at all). They can easily be found in Settings (gear icon)->Battery or Display.- Exercise tracking has become very accurate after only TWO treadmill walks. There is an option at the end of walking or treadmill workouts to calibrate the distance traveled.--- I did not realize this until AFTER my first treadmill walk, so I set my next distance walk to 2.2 mi, which is VERY close to 3.22 km.----- It was over by about 200 meters, so I adjusted it to 3.22 and then my 3rd treadmill walk was within 0.01 km of my actual distance traveled, according to the treadmill, so I was very impressed by that.- Notifications come through quickly from your default apps (messages, phone calls, email) as well as any other app that can send notifications to your phone, like games, security camera apps, etc.--- Although pictures will not be displayed (MMS messages), texts with emojis do work.--- You cannot answer calls from the watch, but you can mute or reject them as caller ID does pop up.--- There is an option in the settings to deactivate notifications while your phone screen is unlocked, which is nice so you're not getting them in two places at once.- Screen and overall user interface is very responsive - I was slightly uneasy about buying a watch with no buttons at all, but the screen feels incredibly reliable.--- Also, there are a TON of different displays to switch to, simple Analog & Digital ones, as well as ones with more information and customizable ones into which you can insert pictures. This all feels great.- Size & Design are very appealing - the screen does not feel too large even for my girlfriend - it is the perfect size.- Sleep tracking with heart rate monitoring & REM tracking also feels pretty accurate. There is also an option to monitor night-time breathing rate, but that consumes more battery so I have not checked that off yet._:CONS:_- Firstly, as it goes with many electronics and apps, it feels like you are signing your life and naming rights of your firstborn child away upon setup, but there is an easy-to-find option in the section \"Profile->About this app\" to \"Revoke Authorization\" if you change your mind on how much data is collected.- Alarm app only allows you to \"snooze\" one time, then the alarm will not go off again until the next day, so you may need to set multiple alarms if you sleep through your first one, like I often do.- I cannot find out how to change the distance units from the default km; you are able to change the weather units from C to F, but I have not yet found the option to toggle km to miles if it exists.- Hiking & Walking programs: I do not believe there is a difference between these at all; this is not so much of a complaint, but on my older GPS-tracking watches, both programs would track your route. In addition, Hiking would also include changes in altitude, which I very much liked. So color me slightly disappointed to find, at the end of my hike, hills had not been accounted for. Again, minor thing overall, but that would have been nice to be included in the workout summary._:NEUTRALS:_- In regards to the app, it is overall easy to use and find things.- One odd thing is that the \"Workout\" section only contains 5 icon at the top (Outdoor running, Walking, Outdoor cycling, Treadmill & Jump Rope), but there are a TON more on the actual watch for other activities (aerobic / weight-training / swimming / etc.), just as a FYI...- (not the company's fault) but aftermarket it definitely lighter for bands than other mainstream smartwatches - I've gotten a couple cool magnetic claps ones around the $10 - $15 mark that are well worth it though.OVERALL, for under a hundred bucks, this definitely feels like the best tracker out there in terms of functionality, battery life, and usefulness. I consider myself pretty critical and my caveats are not even impactful enough to remove a star. Also, my girlfriend still raves about hers as well, so she still loves it and hasn't mentioned any of her own cons to me (and I have asked...).",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "Love this watch, doing perfectly what it was designed for and easy to find bands for it on AliExpress for dirt cheap",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "Battery life is great and the, the face options are fun and plenty, and it feels comfortable on my wrist. My only star removal is due, in part, to the app. It's required to run all the time on the phone and it seems to eat the battery life. The battery lasts a long time, regardless, but that also means it can take a long time to charge back up when you need to. I used to charge my Fitbit watches (plural, thanks for crappy quality) while showering. I can't really do that with this unless I leave it charging after the shower is complete. No big deal, however, as it otherwise remains on my wrist all other times of the day.I was not expecting the app to properly sync with my Trainwell fitness app but, surprisingly, it did. It even had the GPS information and a lot of metrics during the run. I didn't even have to do anything to get Trainwell to see the run, it just sucked it right in like me with donuts!I will point out one annoyance, and I'm not 100% sure this is the watch and not Android, but whenever I have a voicemail waiting for me, any time the phone receives signal, where it didn't have signal before, the watch will buzz and show a notification for the pending voicemail. Between my office and parking spot, if there's a VM I know about it at least 3-times during my walk. I looked for a way to turn off certain apps from sending notifications, but either I got distracted or I couldn't find a way to restrict them. It also wants me to let it connect all the time and run in the background, but their instructions for doing that on Android is outdated or doesn't work with my phone cause it never works and constantly tells me to do the app permissions.For an inexpensive fitness tracker and watch, I think the quality more than exceeds the price!",
        "rating": "4.0 out of 5 stars"
      },
      {
        "review": "Excelente producto, de muy buena calidad, gracias",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "Excelente duración de la batería 25 dias sin cargar y aun tenia un 14%, el GPS se activo unas dos veces en todos  esos dias, ligero de llevar y con suficiente funciones deportivas.",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "I was surprised with how well this is working out. The online community for using these is impressive as well. I very much enjoy the features, I will definitely be going this route when I upgrade to another one down the road, for now it's going to be my everyday watch.",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "Excelente",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "Americans dont waste your money. Measurements are only in metric, which they dont even bother to mention in the description. The fact that they sell this in America and dont address the units of measurement means either they are ignorant or clueless. KM not miles. Kilos not lbs. Celsius not Fahrenheit.  And the hoops you have to jump through to use the app is ridiculous. Its a damn app, not fort knox. The app is not very intuitive either.",
        "rating": "1.0 out of 5 stars"
      }
    ]
  },
  {
    "title": "Xiaomi Redmi Watch 5 Lite Global 1.96\" Amoled Up to 18 Days Battery GNSS Dual Mic 150+ Workout Modes 5ATM Water Resistance Heart Rate Sensor (Light Gold)",
    "rating": "4.3 out of 5 stars",
    "price": "$54.99",
    "features": "Phone Call",
    "Battery Capacity": "470 Milliamp Hours",
    "Connectivity": "Bluetooth",
    "GPS": "Built-in GPS",
    "Screen Size": "1.96 Inches",
    "img_url": "https://m.media-amazon.com/images/I/71oay29qeLL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "Brand": "Xiaomi",
    "Review": [
      {
        "review": "Amazing watch! I bought it for my wife two months ago. The battery lasts a long time — I think we charged it every 10 days or two weeks, can’t remember exactly. It has a nice display, lets you receive and make calls, and gives notifications — all for this price. Outstanding watch. Highly recommended. Take my word for it.We tried a lot of other affordable smartwatches, but they all ended up being returned due to poor quality or performance issues. This one is a keeper. Don’t think twice if you’re on a budget — unless you want to spend $500 to $600 on an Apple Watch. We’re using it with an Android phone, so I can’t say how well it works with iPhones.",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "Excelente",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "Su calidad es maravillosa y se ve muy bien.Al principio fue difícil porque no me llegaban las notificaciones, solo podía hacer llamadas. Pero hay que activar manualmente las notificaciones , en el bluetooth te saldrán dos dispositivos llamados redmi Watch 5.",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "It's work and I am happy",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "It arrived with 79% charge and lasted 11 days. I recharged it for the first time on 01/25 and I haven't needed to recharge it yet. Excellent product, it's meeting the purpose for which I bought it and, as a bonus, the battery life is excellent.",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "I wanted to love this watch , but i have an iPhone and my messages don’t go to the watch.. i tried everything and nothing is happening!so i have to return it :(",
        "rating": "2.0 out of 5 stars"
      }
    ]
  },
  {
    "title": "Xiaomi Smart Band 9 Global Version (2024) 1.62\" Amoled Display | 233 mAh Battery | up to 21 Days of Battery Life | Over 150 Workout Modes | BT 5.4 | 50M Water Resistant -Arctic Blue",
    "rating": "4.5 out of 5 stars",
    "price": "$49.90",
    "features": "N/A",
    "Battery Capacity": "500 Milliamp Hours",
    "Connectivity": "Bluetooth",
    "GPS": "GPS Via Smartphone",
    "Screen Size": "1.62 Inches",
    "img_url": "https://m.media-amazon.com/images/I/61bdGKuHMNL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "Brand": "Xiaomi",
    "Review": [
      {
        "review": "It works much better than I expected, it has many functions, it trachea the sleep, the calories, the exercises it has many types of workout to trachear I was afraid that it would not connect well to my iPhone but it was synchronized through its app, the sleep tracker measures when it is light, deep or rem, it also measures stress. Its charge is light that I liked the most it arrived with 60% charge and served me for 10 days and had all the functions active. Without a doubt,",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "Nice product",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "I bought this to replace my Fitbit Charge 5 that recently died, and while I've had it not quite a week I already love it.  Unlike my Fitbit, it has alerted me to high heart rates when I am standing instead of congratulating me on being active like the Fitbit did in the same situation.  Activity tracking is easy, and I haven't had any issues with bumping the tracker and accidentally stopping timers like I did with the Fitbit.  It has all the features I wanted, a few I wasn't looking for but that have been helpful (like being able to switch my phone to do not disturbfrom the tracker), and none of the extra stuff that I didn't want.  I really like how the image on the home screen can be changed, and I was impressed when it bumped yoga to the top of the exercise list after I tracked just one yoga routine. I wish the app could be connected to the fitness app I use, but that's my only complaint.  The app has also been easy to use.  Definitely more than worth the price.",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "i tend to dislike watches in general—all i wanted was the cheapest, smallest stopgap to keep an eye on my heart rate between my last screen-free \"smart jewelry\" fitness tracker dying and (someday) receiving the smart ring i've pre-ordered, but this xiaomi is actually pretty nice. there are lots of cute backgrounds, and i even get compliments on it!have not seen the battery run down hardly at all so far, i just pop it on the charger whenever i shower and that seems to be plenty to keep it going. i don't use mine very extensively, though (eg i don't let it receive my phone notifications), so ymmv by a lot. only leaving 4 stars because i can't actually speak to the accuracy or all the other things it does, but it's been great for my purposes. :)",
        "rating": "4.0 out of 5 stars"
      },
      {
        "review": "the xiaomi band 9 has a lot to offer it's simple but really awesome.",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "Love this watch! Clear screen with functional display. Good battery life (almond a week), useful biometrics. My only complaint is that the app it uses, Mi Fitness,  doesn't sync with main fitness apps. It's not widely recognized, if at all. So I've lost all my regular exercise buddies 😕",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "This fitness band is effective, affordable and the best part is that the battery lasts quite a while. The only thing I don't like about the watch is related to the Mi Fitness app which only allows you to record your weight/height in kg/meters. Overall though Xiaomi made a really great product.",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "My wife loves it.",
        "rating": "5.0 out of 5 stars"
      }
    ]
  },
  {
    "title": "Xiaomi Smart Band 9 Global Version (2024) 1.62\" Amoled Display | 233 mAh Battery | up to 21 Days of Battery Life | Over 150 Workout Modes | BT 5.4 | 50M Water Resistant - Glacier Silver",
    "rating": "4.5 out of 5 stars",
    "price": "$57.99",
    "features": "Heart Rate Monitor",
    "Battery Capacity": "233 Milliamp Hours",
    "Connectivity": "Bluetooth",
    "GPS": "No GPS",
    "Screen Size": "1.62 Inches",
    "img_url": "https://m.media-amazon.com/images/I/61WgY4YsscL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "Brand": "Xiaomi",
    "Review": [
      {
        "review": "This is the 4th generation of Mi Bands I've had, beginning with Mi Band 5. I didn't really like the size switch (I think they made it bigger in gen 8) - as I really liked the slim band that you hardly knew was there. But, I have to say this band feels awfully sleek. And I don't really notice it that much.The band is really soft - they also appear to have made it a little thicker. As I did break 2 or 3 bands over the years, this is probably a good thing.The auto brightness is an awesome new feature - it was always a pain to adjust the watch for different lighting. Overall the look and feel of the operating system is definitely improved. I assume the heart rate tracking is as stellar as ever - Mi Band has always excelled in that area, and been very close to Apple in terms of accuracy. There's a guy on youtube from Germany or Switzerland who has a great technical comparison of different heart rate trackers, and Xiaomi Mi Bands have always done really well there.Sleep tracking has always been not quite as good - but still a lot better than most. For people like me who just want to know \"hey how many hours did I get last night\" this band will undoubtedly be pretty spot on. Deep diving on your REM, etc - it probably won't rival the top trackers.The biggest problem with the Xiaomi ecosystem has always been how crappy their fitness app has been. I used a 3rd party app for a long time. But the newest incarnation of the Mi Fit app that goes with this watch appears to have finally gotten it right. The app sort of gets out of the way, and gives you what you need pretty quickly. It appears to sync well, and works with things like Strava and Apple Health.I wish I could fine tune the watch OS a little more - and get rid of all the activities I don't do, and just have about 5 or 6. I don't really see a way to do that right now.But overall this watch feels like a pretty decent upgrade from the previous bands, including 8.Highly recommended - probably the best fitness tracker on the planet for the money.",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "I've had every single misfit since 3. This one by far is the best. Has all the features that you could ever want with the pricing that is still within the mi fit expectations. Fixed all the slump engineering of previous devices.I've had it since it first came out and I'm just now giving my two cents for reviewing it. I easily go 10 to 14 days between charges while not dialing much down for energy conservation.",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "",
        "rating": "4.0 out of 5 stars"
      },
      {
        "review": "Awesome product for the price. Accurate bpm & step tracking. Mobile app works good and can customize watch with it.USA / iPhone user",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "Está es la tercera que tengo tuve la 5 tuve la 8 y ahora la 9 yo las prefiero sobre les Smart watch por qué traen lo que yo necesito para mí son muy cómodas y se ven bien yo no puedo estar sin traerla ya estoy bastante acostumbrado a traerla",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "Light weight. Bright screen.If you don’t want to have bulky smart watches, this is for you.",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "he tenido el modelo 3,5,8 y 9 y sigue siendo un producto que me gusta mucho, mas refinado en cada generacion",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "I got this watch for my partner and he had it paired with a Samsung phone. It has the Mi Fitness app. Originally, I would have given it 5 stars considering the price and functionality but the strap became loose and he ended up losing it when it fell off. We thought we could track the watch’s location via the Mi Fitness app but it strangely didn’t have that option. Also, the heart rate monitor doesn’t appear accurate in case this is something you want to track.",
        "rating": "3.0 out of 5 stars"
      }
    ]
  },
  {
    "title": "Xiaomi Redmi Watch 5 Smartwatch, 2.07\" LCD Display, 24 Days of Bat Life, 150+ Sports Modes, 2 MIC 5ATM Waterproof, Bluetooth Calling Music Heart Rate, Fitness-Tracker (Obsidian Black)",
    "rating": "4.4 out of 5 stars",
    "price": "$139.99",
    "features": "Voice Call, Lightweight, Activity Tracker, Phone Call",
    "Battery Capacity": "N/A",
    "Connectivity": "Bluetooth",
    "GPS": "No GPS",
    "Screen Size": "2.07 Inches",
    "img_url": "https://m.media-amazon.com/images/I/51X9nE628cL.__AC_SX300_SY300_QL70_ML2_.jpg",
    "Brand": "Xiaomi",
    "Review": [
      {
        "review": "Calidad - precio. El producto es tal lo que su precio te puede ofrecer, si buscas un reloj inteligente barato pero que tenga funciones de deporte, detector de ritmo cardíac, saturacion, sueño, seguimiento de deportes y que puedas llamar y contestar por Bluetooth este reloj es para ti, por otro lado, si buscas un reloj con asistente virtual para controlarlo por medio de la voz pues este no cuenta con esa función.",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "I have enjoyed a long-term positive experience with Xiaomi watches, consistently exceeding my expectations.  This Xiaomi is a top performer.  The battery life is exceptional; it's remarkably long-lasting...",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "I know that Xiaomi makes some good smart watches, but I wasn't able to link to my samsung phone.  It seems like my phone has some issues.",
        "rating": "4.0 out of 5 stars"
      },
      {
        "review": "good watch but kinda small for me and it's not as described , not recommended for this price at all, Amazfit bip 6 is much better and cheaper",
        "rating": "3.0 out of 5 stars"
      },
      {
        "review": "Was good for two months then the battery calibration hardware stopped working on it. Loved the watch but sadly at the price bracket idk if I wanna chance it.",
        "rating": "1.0 out of 5 stars"
      }
    ]
  },
  {
    "title": "Xiaomi Watch 2 Pro, Google apps Directly on Your Wrist, Snapdragon® W5+ Gen 1 Platform, Advanced Health and Workout Tracking, 5-System Dual-Band GNSS, 1.43\" AMOLED Display, Silver",
    "rating": "4.1 out of 5 stars",
    "price": "$259.99",
    "features": "Bluetooth",
    "Battery Capacity": "N/A",
    "Connectivity": "Bluetooth",
    "GPS": "Built-in GPS",
    "Screen Size": "1.43 Inches",
    "img_url": "https://m.media-amazon.com/images/I/81LQkI4eoqL.__AC_SX300_SY300_QL70_ML2_.jpg",
    "Brand": "Xiaomi",
    "Review": [
      {
        "review": "Me encanta este reloj, cumple con todas mis espetactivas",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "Phone is great, evidently had the Xiaomi app before and do not know the password and cannot get it from the provider to be able to use it with this great watch.",
        "rating": "4.0 out of 5 stars"
      }
    ]
  },
  {
    "title": "Xiaomi Redmi 5 Lite Smart Watch, Step Counter Watch for Women Men with 2\" LCD Large Display, 140 Sports Modes, 5ATM Waterproof (Lite-Light Gold)",
    "rating": "4.6 out of 5 stars",
    "price": "$52.24",
    "features": "Multisport Tracker, Activity Tracker, Alarm Clock, Camera, Phone Call",
    "Battery Capacity": "470 Amp Hours",
    "Connectivity": "Bluetooth",
    "GPS": "N/A",
    "Screen Size": "2 Inches",
    "img_url": "https://m.media-amazon.com/images/I/61Mr-G86wZL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "Brand": "Xiaomi",
    "Review": [
      {
        "review": "Although positioned as an entry-level player, the Redmi Watch 5 Active's sporty features are unambiguous. It supports 140 sports modes, including running, swimming (5ATM water resistance), cycling, etc., to meet my daily workout needs. The heart rate monitoring is very stable during exercise, and it can generate detailed reports with the Mi Sports app. The screen is bright enough outdoors and the operation is smooth, the only drawback is the lack of built-in GPS, which requires a mobile phone to assist in positioning. The watch face market is rich in choice, and you can customize the style you like. It's a great deal for people on a budget but want a versatile fitness watch!",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "The watch itself is beyond the pricing point. The only reason for the 4 star is because the wrist band that comes with it is very difficult to put on. It tucks underneath itself on your wrist which is odd. Otherwise I'm more than impressed so far",
        "rating": "4.0 out of 5 stars"
      },
      {
        "review": "As a budget-friendly smartwatch, the Redmi Watch 5 Active completely exceeded my expectations. What surprised me the most was its battery life - even with all-day heart rate monitoring and message notifications turned on, it can easily last for 7-10 days, completely free from the hassle of frequent charging. The 2-inch screen is clear enough to see in sunlight, and the touch is responsive. The sport mode is very useful, and I usually use step tracking and cycling monitoring, and the data accuracy is good. Although GPS is missing, it is possible to record the running route through a mobile phone connection. For a price of less than $70, this watch is definitely the king of value for money!",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "I have to praise it for its battery life! With round-the-clock heart rate and sleep monitoring turned on, it can still last 10 days of charging, which is much better than products in the same price range. The 1.96-inch AMOLED screen is clearly visible in sunlight, and the touch response is also very responsive. I am particularly satisfied with the blood oxygen detection function, which can warn of hypoxia in time when climbing the mountain. The 150 sport mode is perfectly capable of meeting my daily needs. As a daily health monitoring device, this price point is perfect!",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "This is a nice functional watch. The plastic housing is a bit chunky compared to other aluminum models, but at this price that is to be expected. The screen is nice and bright. I have no problem reading it in the Arizona sun. The colors are vivid and lines are crisp. The display detects wrist tilt and turns on and off reliably when you lift your arm to read it. It syncs with my phone reliably and I get notifications on it as well. It was a bit of a pain to sort out the app permissions, but once that was done it works well. You can configure your home screen pages to include shortcuts to favorite activities, stats, music controls, timers, etc. There's a wide variety of faces available from minimalist to information overload. Battery life is great, with 5-7 days being standard for me. The factory strap is a bit of a pain to put on, but it uses standard watch straps with quick release pins, so any generic 22mm strap should fit. Heart rate and SpO2 monitoring seem accurate, and it detects activity well. There are a couple things I wish were different. Weight and height are in metric only, so if you're tracking weight loss you'll need to convert each time. The contacts for phone calls don't work. I can see my contacts, but the watch is unable to use them to dial a call. Manual keypad dialing does work though, oddly enough. There is no auto brightness on this model, so it can be a bit bright in dark rooms. It will sync night mode with local sunrise and sunset though, which helps. There are some cool geared/steampunk style mechanical faces available, but they are static. Outside of analog hand movement, there are no animations available. Overall, this offers a lot of functionality and is a solid choice at a great price point.",
        "rating": "4.0 out of 5 stars"
      },
      {
        "review": "The Redmi Watch 5 Active is the most hassle-free smart watches I've ever bought. The appearance is simple, and it can be adapted to business or leisure scenes with various straps. The Bluetooth call function is very convenient, and the vibration feedback is gentle and unobtrusive. The battery life is excellent and the charging speed is fast (about 2 hours to fully charge). The downside is that there is less support for third-party apps, but it's perfectly sufficient for users who only need basic smart features. Super cost-effective, recommended for those who pursue pragmatism!",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "Nice Watch The smartwatch is beyond my imagination, with a very smooth screen swipe and a custom watch face feature that allows me to change the style every day. The message reminder is very timely, WeChat/SMS/email can vibrate and remind, and you will never miss important information during the meeting.",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "First, this is a great budget-friendly active smart watch. The large LCD display is very nice, and I appreciated the different display options you could use. It's very easy to use and set up. My main reason for getting this watch was for running. I tested this product for a week, and due to my needs, it was not sufficient (aka tracking my run).In regards to running, it took a while to acquire the GPS, and while running, I was consistently notified of a 'low signal'. I have a running partner, and we would compare our data, and it was not the same. The majority of my runs will track the mileage, but it cannot track the location (aka provide the map visual [Strava]) due to the 'low signal'. Also, if you are from the US, this device uses the metric system (e.g., kilometers), and you cannot change it (I tried). Due to this, I returned the device.Overall, I would recommend it for the day-to-day and basic health tracking, but NOT for those who are active and track mileage.",
        "rating": "4.0 out of 5 stars"
      }
    ]
  },
  {
    "title": "Xiaomi Redmi Watch 4 Smartwatch with 1.97\" AMOLED Display with 390 x 450 Pixels and 60Hz, up to 20 Days Battery Life, HyperOS, Heart Rate and Blood Oxygen Measurements",
    "rating": "4.4 out of 5 stars",
    "price": "$74.99",
    "features": "Heart Rate Monitor",
    "Battery Capacity": "20 days",
    "Connectivity": "Bluetooth",
    "GPS": "Built-in GPS",
    "Screen Size": "1.97 Inches",
    "img_url": "https://m.media-amazon.com/images/I/71tozl-916L.__AC_SX300_SY300_QL70_ML2_.jpg",
    "Brand": "Xiaomi",
    "Review": [
      {
        "review": "Perfect, everything works great easy to set up, battery life is great, good quality, reasonable price",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "Great watch for working out and keeping track of your fitness and also montor sleeping. Beautiful design and huge screen.",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "I have had a number of smartwatches including several different Fitbits and I like this the best of all I have tried.  I have been using this watch for several months now.  Most everything about the watch is excellent.  Set up was easy. I gave it only four stars because the sleep tracking seems inaccurate, missing most of the awake time. Also, the auto detection of workouts just takes too long to detect that you are working out.  But, the step counting, GPS, heart rate, SPO2, music control, phone functions all are very good.  I do wish that you could see distance in miles as opposed to kilometers and that you could reply to text messages (you can see the message but not reply).  I love the beautiful large display; the amazing battery life and how quick it charges; and its flawless touch sensitivity and operation.  All in all, I am very happy with this watch.  And yes, the watch band was not very convenient as other owners have reported but you can purchase a variety of different bands that attach very easily on TEMU, AliExpress, or Amazon.  I bought several bands that I love.",
        "rating": "4.0 out of 5 stars"
      },
      {
        "review": "Awsome product... Good price and reabilty",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "My husband used it after he got it, very reliable battery life he did not have to charge it for 2 weeks. He has also tried it swimming in the pool and had no issues at all.",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "Me encanta",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "",
        "rating": "5.0 out of 5 stars"
      },
      {
        "review": "This watch is actually pretty darn good. The features are good, it looks awesome, there are tons of watch faces available, it auto detects your workout, the battery life is great, you can customize the cards, you can answer your phone on it, it seems fairly accurate with vitals, I mean for the value, it's pretty awesome!So why only 1 star?1. You can't change units of measurement from metric to imperial units2. It does connect to Google fit, but it's very inconsistent. Every once in a while the heartrate will transfer over, but it'll only transfer a very small data set, and then it won't transfer again for hours or days, even if I try to manually sync.I love all the good features, but this negative ones outweigh everything else. I reached out to the manufacturer about it, literally got zero response. Very disappointing because I have purchased 6 of their phones in the past, and some other devices from them.",
        "rating": "1.0 out of 5 stars"
      }
    ]
  }
]